public class note {
    /*примитивные и реферральные типы данных
    примитивные - полные клоны а - а
    реферальные - клоны где а может быть rf

    Сигнатура - имя фунции + количество аргументов
    Когда сигнатура абсолютно одинаковая, тогда приходится менять имя функции

   из-за приватных методов мы получаем доступ через
сеттеры и геттеры
вся эта длинная хератень называется ИНКАПСУЛЯЦИЯ

КОНСТРУКТОРЫ
это тип методов. имя конструктора всегда совпадает с именем класса и у конструктора нет ВОЗВРАЩАЕМОГО значения.
должны быть public
в одном классе может быть несколько конструкторов
Конструктор создает новый объект!!!!!

Суперсеттеры

     */
}
